{
  "The Grand Inquisitors": {
    "content": [
      "Towns across Avandria are commonly ravaged by Bandits where the only assistance from the grand inquisitors is the unrelenting destruction of entire cities by dragon-fire after control is already relinquished to the bandits.",
      "Outer villages are more fortunate as they are merely raided on a consistent basis by bandits and goblins. Many of these lower villages have reached an alliance with competing bandit tribes, paying them everything for protection against other bandit groups and tribes.",
      "The grand inquisitors are ferocious and incredibly powerful controlling most of the lands wealth and decimating any other regions whom claim unfairness in the inquisitors dealings. The most powerful asset of the inquisitors is their refined magical technology which allows them to imprison dragons which can then be trained by the highest warriors of the inquisitors to be used as ferocious weapons against their enemies."
    ]
  },
  "The Order of the Dragon": {
    "content": [
      "Long before the grand inquisitors reign over Avandria, the lands were writhe with ancient dragons whom were worshipped by most. They offered protection against other regions whilst accepting gold, precious minerals, and the occasional human sacrifice from their disciples. Their greatest allies were the Order of the Dragon which were an elite group of warriors and spellcasters - typically Dragonborn - which would lead crusades against Avandria's adversaries.",
      ""
    ]
  },
  "The Skull Queen": {
    "content": [
      "After the heretics imprisoned the dragons and drove the ancient black dragon - Tynnyr - deep into the underdark, an unlikely ally came to his aid. A small tribe of drow cured his wounds and made a pact with the great spider queen lolth to grant him a wealth of new power. In return, Tynnyr bestowed his knowledge of necromancy and death magic unto a member of the drows elite sorceres - Filraen Despt'tar - a young halfblood woman with great promise due to a powerful fey bloodline.",
      ""
    ]
  }
}
