[
    {
      "name": "Ammunition +1",
      "type": "Any Ammunition",
      "rarity": "Uncommon",
      "attunement": "Not Required",
      "properties": "",
      "description": "You have a +1 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is no longer magical.",
      "bonus": "Magic, Damage",
      "damage": "",
      "cursed": false,
      "notes": ""
    },
    {
        "name": "Ammunition +2",
        "type": "Any Ammunition",
        "rarity": "Rare",
        "attunement": "Not Required",
        "properties": "",
        "description": "You have a +2 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is no longer magical.",
        "bonus": "Magic, Damage",
        "damage": "",
        "cursed": false,
        "notes": ""
    },
    {
        "name": "Ammunition +3",
        "type": "Any Ammunition",
        "rarity": "Very Rare",
        "attunement": "Not Required",
        "properties": "",
        "description": "You have a +3 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is no longer magical.",
        "bonus": "Magic, Damage",
        "damage": "",
        "cursed": false,
        "notes": ""
    },
    {
        "name": "Arrow of Slaying",
        "type": "Arrow",
        "rarity": "Very Rare",
        "attunement": "Not Required",
        "properties": "",
        "description": "An arrow of slaying is a magic weapon meant to slay a particular kind of creature. Some are more focused than others; for example, there are both arrows of dragon slaying and arrows of blue dragon slaying. If a creature belonging to the type, race, or group associated with an arrow of slaying takes damage from the arrow, the creature must make a DC 17 Constitution saving throw, taking an extra 6d10 piercing damage on a failed save, or half as much extra damage on a successful one. Once an arrow of slaying deals its extra damage to a creature, it becomes a nonmagical arrow. Other types of magic ammunition of this kind exist, such as bolts of slaying meant for a crossbow, though arrows are most common.",
        "bonus": "",
        "damage": "Piercing",
        "cursed": false,
        "notes": "Damage, Combat, Bane"
    },
    {
        "name": "Axe of the Dwarvish Lords",
        "type": "Battleaxe",
        "rarity": "Artifact",
        "attunement": "Required",
        "properties": "Topple",
        "description": "Seeing the peril his people faced, a young dwarf prince came to believe that his people needed something to unite them. Thus, he set out to forge a weapon that would be such a symbol. Venturing deep under the mountains, deeper than any dwarf had ever delved, the young prince came to the blazing heart of a great volcano. With the aid of Moradin, the dwarven god of creation, he first crafted four great tools: the Brutal Pick, the Earthheart Forge, the Anvil of Songs, and the Shaping Hammer. With them, he forged the Axe of the Dwarvish Lords. Armed with the artifact, the prince returned to the dwarf clans and brought peace. His axe ended grudges and answered slights. The clans became allies, and they threw back their enemies and enjoyed an era of prosperity. This young dwarf is remembered as the First King. When he became old, he passed the weapon, which had become his badge of office, to his heir. The rightful inheritors passed the axe on for many generations. Later, in a dark era marked by treachery and wickedness, the axe was lost in a bloody civil war fomented by greed for its power and the status it bestowed. Centuries later, the dwarves still search for the axe, and many adventurers have made careers of chasing after rumors and plundering old vaults to find it. \n\nMagic Weapon \nThe Axe of the Dwarvish Lords is a magic weapon that grants a +3 bonus to attack and damage rolls made with it. The axe also functions as a belt of dwarvenkind, a dwarven thrower, and a sword of sharpness.\n\nRandom Properties\nThe axe has the following randomly determined properties:\n2 minor beneficial properties\n1 major beneficial property\n2 minor detrimental properties\n\nBlessings of Moradin\nIf you are a dwarf attuned to the axe, you gain the following benefits:\nYou have immunity to poison damage.\nThe range of your darkvision increases by 60 feet.\nYou gain proficiency with artisan’s tools related to blacksmithing, brewing, and stonemasonry.\n\nConjure Earth Elemental\nIf you are holding the axe, you can use your action to cast the conjure elemental spell from it, summoning an earth elemental. You can’t use this property again until the next dawn.\n\nTravel the Depths\nYou can use an action to touch the axe to a fixed piece of dwarven stonework and cast the teleport spell from the axe. If your intended destination is underground, there is no chance of a mishap or arriving somewhere unexpected. You can’t use this property again until 3 days have passed.\n\nCurse\nThe axe bears a curse that affects any non-dwarf that becomes attuned to it. Even if the attunement ends, the curse remains. With each passing day, the creature’s physical appearance and stature become more dwarflike. After seven days, the creature looks like a typical dwarf, but the creature neither loses its racial traits nor gains the racial traits of a dwarf. The physical changes wrought by the axe aren’t considered magical in nature (and therefore can’t be dispelled), but they can be undone by any effect that removes a curse, such as a greater restoration or remove curse spell.\n\nDestroying the Axe\nThe only way to destroy the axe is to melt it down in the Earthheart Forge, where it was created. It must remain in the burning forge for fifty years before it finally succumbs to the fire and is consumed.\n\nProficiency with a Battleaxe allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
        "bonus": "Constitution Score, Magic",
        "damage": "Additional",
        "advantage": "Persuasion",
        "immunity": "Poison",
        "sense": "Darkvision",
        "proficiency": "Brewer's Supplies, Mason's Tools, Smith's Tools",
        "cursed": true,
        "notes": "Damage, Buff, Debuff, Combat, Cursed, Versatile"
    },
    {
        "name": "Berserker Axe",
        "type": "Any Axe",
        "rarity": "Rare",
        "attunement": "Required",
        "properties": "Topple",
        "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. In addition, while you are attuned to this weapon, your hit point maximum increases by 1 for each level you have attained.\n\nCurse. This axe is cursed, and becoming attuned to it extends the curse to you. As long as you remain cursed, you are unwilling to part with the axe, keeping it within reach at all times. You also have disadvantage on attack rolls with weapons other than this one, unless no foe is within 60 feet of you that you can see or hear.\n\nWhenever a hostile creature damages you while the axe is in your possession, you must succeed on a DC 15 Wisdom saving throw or go berserk. While berserk, you must use your action each round to attack the creature nearest to you with the axe. If you can make extra attacks as part of the Attack action, you use those extra attacks, moving to attack the next nearest creature after you fell your current target. If you have multiple possible targets, you attack one at random. You are berserk until you start your turn with no creatures within 60 feet of you that you can see or hear.",
        "bonus": "Magic, Hit Points per Level",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": true,
        "notes": "Combat, Versatile"
    },
    {
        "name": "Blackrazor",
        "type": "Greatsword",
        "rarity": "Legendary",
        "attunement": "Required",
        "properties": "Graze",
        "description": "Hidden in the dungeon of White Plume Mountain, Blackrazor shines like a piece of night sky filled with stars. Its black scabbard is decorated with pieces of cut obsidian.\n\nYou gain a +3 bonus to attack and damage rolls made with this magic weapon. It has the following additional properties.\n\nDevour Soul\nWhenever you use it to reduce a creature to 0 hit points, the sword slays the creature and devours its soul, unless it is a construct or an undead. A creature whose soul has been devoured by Blackrazor can be restored to life only by a wish spell.\n\nWhen it devours a soul, Blackrazor grants you temporary hit points equal to the slain creature’s hit point maximum. These hit points fade after 24 hours. As long as these temporary hit points last and you keep Blackrazor in hand, you have advantage on attack rolls, saving throws, and ability checks.\n\nIf you hit an undead with this weapon, you take 1d10 necrotic damage and the target regains 1d10 hit points. If this necrotic damage reduces you to 0 hit points, Blackrazor devours your soul.\n\nSoul Hunter\nWhile you hold the weapon, you are aware of the presence of Tiny or larger creatures within 60 feet of you that aren’t constructs or undead. You also can’t be charmed or frightened.\n\nBlackrazor can cast the haste spell on you once per day. It decides when to cast the spell and maintains concentration on it so that you don’t have to.\n\nSentience\nBlackrazor is a sentient chaotic neutral weapon with an Intelligence of 17, a Wisdom of 10, and a Charisma of 19. It has hearing and darkvision out to a range of 120 feet.\n\nThe weapon can speak, read, and understand Common, and can communicate with its wielder telepathically. Its voice is deep and echoing. While you are attuned to it, Blackrazor also understands every language you know.\n\nPersonality\nBlackrazor speaks with an imperious tone, as though accustomed to being obeyed.\n\nThe sword’s purpose is to consume souls. It doesn’t care whose souls it eats, including the wielder’s. The sword believes that all matter and energy sprang from a void of negative energy and will one day return to it. Blackrazor is meant to hurry that process along.\n\nDespite its nihilism, Blackrazor feels a strange kinship to Wave and Whelm, two other weapons locked away under White Plume Mountain. It wants the three weapons to be united again and wielded together in combat, even though it violently disagrees with Whelm and finds Wave tedious.\n\nBlackrazor’s hunger for souls must be regularly fed. If the sword goes three days or more without consuming a soul, a conflict between it and its wielder occurs at the next sunset.\n\nProficiency with a Greatsword allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
        "bonus": "Magic",
        "damage": "",
        "advantage": "Saving Throws, Ability Checks, Melee Attacks, Ranged Attacks",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": true,
        "notes": "Creature of Non-Lawful Alignment, Damage, Buff, Combate, Bane, Sentient, Heavy, Two-Handed"
    },
    {
        "name": "Boomerang +1",
        "type": "Boomerang",
        "rarity": "Uncommon",
        "attunement": "Not Required",
        "properties": "",
        "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon.\n\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\n\nOn a miss, a boomerang returns to the thrower's hand.",
        "bonus": "Magic",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Damange, Combat, Range"
    },
    {
        "name": "Boomerang +2",
        "type": "Boomerang",
        "rarity": "Rare",
        "attunement": "Not Required",
        "properties": "",
        "description": "You have a +2 bonus to attack and damage rolls made with this magic weapon.\n\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\n\nOn a miss, a boomerang returns to the thrower's hand.",
        "bonus": "Magic",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Damange, Combat, Range"
    },
    {
        "name": "Boomerang +3",
        "type": "Boomerang",
        "rarity": "Very Rare",
        "attunement": "Not Required",
        "properties": "",
        "description": "You have a +3 bonus to attack and damage rolls made with this magic weapon.\n\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\n\nOn a miss, a boomerang returns to the thrower's hand.",
        "bonus": "Magic",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Damange, Combat, Range"
    },
    {
        "name": "Dagger of Venom",
        "type": "Dagger",
        "rarity": "Rare",
        "attunement": "Not Required",
        "properties": "Nick",
        "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\n\nYou can use an action to cause thick, black poison to coat the blade. The poison remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take 2d10 poison damage and become poisoned for 1 minute. The dagger can't be used this way again until the next dawn.\n\nProficiency with a Dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
        "bonus": "Magic",
        "damage": "Poison",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Poisoned, Damage, Debuff, Combat, Finesse, Light, Thrown"
    },
    {
        "name": "Dancing Sword",
        "type": "Any Sword",
        "rarity": "Very Rare",
        "attunement": "Required",
        "properties": "",
        "description": "You can use a bonus action to toss this magic sword into the air and speak the command word. When you do so, the sword begins to hover, flies up to 30 feet, and attacks one creature of your choice within 5 feet of it. The sword uses your attack roll and ability score modifier to damage rolls.\n\nWhile the sword hovers, you can use a bonus action to cause it to fly up to 30 feet to another spot within 30 feet of you. As part of the same bonus action, you can cause the sword to attack one creature within 5 feet of it.\n\nAfter the hovering sword attacks for the fourth time, it flies up to 30 feet and tries to return to your hand. If you have no hand free, it falls to the ground at your feet. If the sword has no unobstructed path to you, it moves as close to you as it can and then falls to the ground. It also ceases to hover if you grasp it or move more than 30 feet away from it.",
        "bonus": "",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Damage, Combat"
    },
    {
        "name": "Defender",
        "type": "Any Sword",
        "rarity": "Legendary",
        "attunement": "Required",
        "properties": "Sap",
        "description": "You gain a +3 bonus to attack and damage rolls made with this magic weapon.\n\nThe first time you attack with the sword on each of your turns, you can transfer some or all of the sword’s bonus to your Armor Class, instead of using the bonus on any attacks that turn. For example, you could reduce the bonus to your attack and damage rolls to +1 and gain a +2 bonus to AC. The adjusted bonuses remain in effect until the start of your next turn, although you must hold the sword to gain a bonus to AC from it.",
        "bonus": "Magic",
        "damage": "",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Damage, Combat, Warding, Versatile"
    },
    {
        "name": "Devotee's Censer",
        "type": "Flail",
        "rarity": "Rare",
        "attunement": "Required by Cleric or Paladin",
        "properties": "Sap",
        "description": "The rounded head of this flail is perforated with tiny holes, arranged in symbols and patterns. The flail counts as a holy symbol for you. When you hit with an attack using this magic flail, the target takes an extra 1d8 radiant damage.\n\nAs a bonus action, you can speak the command word to cause the flail to emanate a thin cloud of incense out to 10 feet for 1 minute. At the start of each of your turns, you and any other creatures in the incense each regain 1d4 hit points. This property can’t be used again until the next dawn.\n\nProficiency with a Flail allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
        "bonus": "",
        "damage": "Radiant",
        "advantage": "",
        "immunity": "",
        "sense": "",
        "proficiency": "",
        "cursed": false,
        "notes": "Cleric or Paladin"
    }
]